import React from "react";
import styles from "../styles/Labs.module.css";
import { Link } from "react-router-dom";
import Formulas from "../img/formulas/number-of-placements.png";
import BlockDiagram1 from "../img/block-diagrams/lab-1.1.png";
import BlockDiagram2 from "../img/block-diagrams/lab-1.2.png";
import Result1 from "../img/results/result-1.1.png";
import Result2 from "../img/results/result-1.2.png";

const Lab1 = () => {
  return (
    <main className={`container ${styles.labContainer}`}>
      <h2>Лабораторна робота №1</h2>
      <h3>
        "Використання рекурсії для організації повторювальних процесів"
        <span>12 варіант</span>
      </h3>
      <h4>
        <span>Виконала: </span>
        Коржова Єлизавета Валеріївна
      </h4>
      <div>Зміст</div>
      <ul>
        <li>
          <Link to="/">Мета лабораторної роботи</Link>
        </li>
        <li>
          <Link to="/">Умова задачі</Link>
        </li>
        <li>
          <Link to="/">Структура програми</Link>
        </li>
        <li>
          <Link to="/">
            Обгрунтування вибору середовища та мови функціонального
            програмування
          </Link>
        </li>
        <li>
          <Link to="/">Код програми з коментарями</Link>
        </li>
        <li>
          <Link to="/">Посилання на проект з вихідним кодом</Link>
        </li>
        <li>
          <Link to="/">Скріншоти результатів</Link>
        </li>
        <li>
          <Link to="/">Аналіз достовірності результатів</Link>
        </li>
        <li>
          <Link to="/">Висновки</Link>
        </li>
      </ul>
      <div>
        <span>Мета - </span>
        сформувати декларативне мислення в галузі програмування завдяки
        використанню чистих функцій, рекурсій замість циклів, запобіганню даних,
        що змінюються. Опанувати застосування рекурсивних функцій для
        обчислювальних процесів.
      </div>
      <div>
        <h5>Умова задачі </h5>
        Написати процедури, що обчислюють задану функцію за допомогою
        рекурсивного процесу. Продемонструвати застосування звичайної та
        хвостової рекурсії.
      </div>
      <ol>
        <li>
          Ввести з клавіатури два натуральних числа n та k. Кількість розміщень
          без повторень і кількість сполучень без повторень. Застосувати формули
          для розрахунку кількості розміщень і сполучень для визначення
          кількості способів розподілу k обов'язків між n членами комісії та
          кількості способів розподілу уроків в n класах між трьома вчителями,
          якщо кожен учитель викладатиме у k класах. Визначити глибину рекурсії.
          <span>
            <img src={Formulas} alt="formulas" />
          </span>
        </li>
        <li>
          Увести з клавіатури натуральне число n, десятковий запис якого не
          містить нулів. Отримайте число, записане тими самими цифрами, але в
          протилежному порядку. При розв'язанні цього завдання не можна
          використовувати цикли, рядки, списки, масиви, дозволяється тільки
          рекурсія і цілочислова арифметика. Функція повинна повертати ціле
          число, яке є результатом роботи програми, виводити число по одній
          цифрі не можна. Контрольний тест: введено число 179, отримали
          результат: 971.
        </li>
      </ol>
      <h5>Структура задачі</h5>
      <img src={BlockDiagram1} alt="Block Diagram" />
      <div>Рис.1 - структура задачі №1.</div>
      <img src={BlockDiagram2} alt="Block Diagram" />
      <div>Рис.1 - структура задачі №2.</div>
      <h5>
        Обгрунтування вибору середовища та мови функціонального програмування
      </h5>
      <div>
        Була обрана мова програмування Sheme, так як вона має легкий, зрозумілий
        синтаксис, який поюснюють на лекціях, практичних, а також рекомендована
        лектором.
      </div>
      <div>
        IDE -{" "}
        <a href="https://www.jdoodle.com/execute-scheme-online/">
          Online CLISP IDE.{" "}
        </a>
        Головною перевагою для вибору данного середовища розробки є те що його
        не потрібно встановлювати. онлайн
      </div>
      <h5>Код програми з коментарями</h5>
      <div>
        <div>Код програми №1</div>
        <pre>
          <code>
            {`(define (factorial n) ; Визначаємо функцію factorial
          (define (factorial-times n acc) ; Визначаємо допоміжну функцію factorial-times, для того, щоб використовувати 
          хвоствову рекурсію
          (if (= n 0) ; Якщо поточне число n - нуль
          acc ; повернути аккумулятор
          (factorial-times (- n 1) (* n acc)))) ; інакше, визвати рекурсивно цю функцию, передавши n на єдиницю меншим, 
          а асс помноживши на поточне n
          (if (< n 0) ; Якщо n менший за нуль
          (display "Incorrect parameter n\\n") ; то не будемо нічого викликати та повертати, просто виведемо в консоль, 
          що параметр не вірний
          (begin ; початок багатострокового коду
          (display "Recursion depth: ")
          (display n)
          (newline)
          (factorial-times n 1)))) ; перший виклик хвостової рекурсії

          (define (A k n) (/ (factorial n) (factorial (- n k)))) ; функція для знаходження кількості розміщень 
          (за формулою)
          (define (C k n) (/ (factorial n) (factorial k) (factorial (- n k)))) ; функція для знаходження 
          кількості сполучень (за формулою)


          (display "TASK 1\\n")
          (display (C 2 5)) ; розподіл двох завданнь між 5 членами коміссії
          (display "\\nTASK 2\\n")
          (display (* 3 (C 4 10))) ; розподіл уроків в 10 класах між 3 вчителями, якщо кожен вчитель викладатиме у 4 класах`}
          </code>
        </pre>
      </div>
      <div>
        <div>Код програми №2</div>
        <pre>
          <code>
            {`(define (log10 n) (/ (log n) (log 10))) ; визначення функції для знаходження десяткового логарифму

               (define (reverse num) ; визначення функції для перевертання числа
                    (define (reverse-times num acc) ; визначення функції для використання хвостової рекурсії
                        (if (= num 0) ; якщо поточне число 0
                        acc ; повернути аккумулятор
                        (reverse-times ; рекурсивно визнати цю функції, передавши
                            (quotient num 10) ; в num цілу частину від ділення поточного num на 10
                            (+ (* (modulo num 10) (expt 10 (floor->exact (log10 num)))) acc)))) ; в acc поточний acc,
                             додавши до нього останню цифру поточного числа домножену на 10 в такій степені, щоб 
                             довжина отриманного числа дорівлювала довжині поточного
                    (reverse-times num 0)) ; перший виклик хвостової рекурсії

                (display (reverse 132433)) ; перевернути число 132433
                (display "\\n")
                (display (reverse 179)) ; перевернути число 179`}
          </code>
        </pre>
      </div>
      <h5>Посилання на проект з вихідним кодом</h5>
      <div>
        <a href="https://github.com/HotSweetie/FunctionalProgramming/blob/main/labs/lab_1_1.txt">
          Посилання на код програми №1 на віддаленому репозиторію GitHub
        </a>
      </div>
      <div>
        <a href="https://github.com/HotSweetie/FunctionalProgramming/blob/main/labs/lab_1_2.txt">
          Посилання на код програми №2 на віддаленому репозиторію GitHub
        </a>
      </div>
      <h5>Скріншоти результатів</h5>
      <div>Результат роботи програми №1</div>
      <img src={Result1} alt="Result" />
      <div>Результат роботи програми №2</div>
      <img src={Result2} alt="Result" />
      <h5>Аналіз достовірності результатів</h5>
      <div>
        Першим завдання було реалізувати формули розміщень та сполучення, задля
        їх написання спочатку було написано програму, яка рахує факторіал числа,
        та після даний факторіал було використано для розрахунків відповідно
        записаних раніше формул. Розраховуючи факторіал числа було використано
        хвостову рекурсію. Результати співпадають з очікуваними. Другим
        завданням було перевнути число. Використовуючи десятковий логарифм для
        знаходження довжини числа, було перевернуте число. Результати
        співпадають з очікуваними
      </div>
      <h5>Висновки</h5>
      <div>
        В результаті роботи було вирішено два задання за допомогою мови Shema.
        Перша задача була реалізована за допомогою хвостової та звичайної
        рекурсії. Друга задача була реалізовна за допомогою звичайної рекурсії.
      </div>
    </main>
  );
};

export default Lab1;
